Berichtencatalogus/uitgifteservice/DC_Request_BoundingBox.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchCharacteristicsRequest 
                xmlns="http://www.broservices.nl/xsd/dsbhr-gt/2.1"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:gml="http://www.opengis.net/gml/3.2"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsbhr-gt/2.1 https://schema.broservices.nl/xsd/dsbhr-gt/2.1/dsbhr-gt-messages.xsd"
            >
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
                 Het houdt geen rekening met bedrijfsregels en is mogelijkerwijs vaktechnisch/inhoudelijk niet voorbeeldig.
            -->
            <brocom:requestReference>uitgifte-18</brocom:requestReference>
            <criteria>
                <brocom:deliveryAccountableParty>52766179</brocom:deliveryAccountableParty>
                <brocom:area>
                    <brocom:boundingBox srsName="urn:ogc:def:crs:EPSG::4258" srsDimension="2">
                        <gml:lowerCorner>52.1 5.0</gml:lowerCorner>
                        <gml:upperCorner>52.3 5.2</gml:upperCorner>
                    </brocom:boundingBox>
                </brocom:area>
            </criteria>
        </dispatchCharacteristicsRequest>
    </soap:Body>
</soap:Envelope>
